#Tarea 2 -- formulario de carga de datos y respuestas

En este notebook pueden ingresar sus respuestas a las preguntas de tarea 2, y asegurarse que sus comandos SQL funcionan de manera adecuada.



### Cargar SQLite y subir la base de datos a Google Colab

Cómo siempre, para poder ocupar el notebook, lo deben subir a https://colab.research.google.com

Luego, ejecutando el siguiente campo, se crea una instancia de servidor SQLite, se creará el esquema vista en el enunciado, y se cargarán los datos desde un google drive.

In [1]:
!pip install SQLAlchemy==1.4.4

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy==1.4.4 in /usr/local/lib/python3.9/dist-packages (1.4.4)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.9/dist-packages (from SQLAlchemy==1.4.4) (2.0.2)

In [2]:
%reload_ext sql
!wget -O datos_T2.db --no-check-certificate https://drive.google.com/uc\?export\=download\&id\=1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o

%sql sqlite:///datos_T2.db

--2023-04-14 21:05:05--  https://drive.google.com/uc?export=download&id=1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o
Resolving drive.google.com (drive.google.com)... 74.125.31.102, 74.125.31.100, 74.125.31.138, ...
Connecting to drive.google.com (drive.google.com)|74.125.31.102|:443... connected.
HTTP request sent, awaiting response... 303 See Other
Location: https://doc-00-88-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/8hbfcbjdeonddgvpc5jij9kupob8nrnf/1681506300000/10980901926740711681/*/1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o?e=download&uuid=6520b304-9fe7-433d-a131-7dcc48e7dfd3 [following]
Warning: wildcards not supported in HTTP.
--2023-04-14 21:05:05--  https://doc-00-88-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/8hbfcbjdeonddgvpc5jij9kupob8nrnf/1681506300000/10980901926740711681/*/1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o?e=download&uuid=6520b304-9fe7-433d-a131-7dcc48e7dfd3
Resolving doc-00-88-docs.googleusercontent.com (doc-00-88-docs.googleusercontent.com)... 142.251.107.132, 2607:f8b0:400c:c32::84
Connecting to doc-00-88-docs.googleusercontent.com (doc-00-88-docs.googleusercontent.com)|142.251.107.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 118784 (116K) [application/octet-stream]
Saving to: ‘datos_T2.db’

datos_T2.db         100%[===================>] 116.00K  --.-KB/s    in 0.001s

2023-04-14 21:05:05 (76.8 MB/s) - ‘datos_T2.db’ saved [118784/118784]

##Pregunta 1

Para asegurarse qué la base de datos está cargada, en esta pregunta deben correr una serie de comandos de tipo:
```
SELECT *
FROM NombreTabla
LIMIT 5; 
```

Por ejemplo, para ver la tabla `Persona`, puedes correr:

```
SELECT *
FROM Persona
LIMIT 5;
```

Dado que nuestras tablas tienen 100 o más tuplas, desplegaremos solo las primeras 5 con el comando `LIMIT 5`.

### Persona

In [3]:
%%sql

SELECT *
FROM Persona
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[('Brian Sanders', '442-30-8082', '127-998-7310', 'brian.sanders@mail.cl'),
 ('Caleb Simpson', '151-44-5451', '+1-741-621-2285', 'caleb.simpson@mail.cl'),
 ('Kelly Mccullough', '315-42-0080', '417-906-4707', 'kelly.mccullough@uc.cl'),
 ('Jason Martin', '562-11-8702', '5667649532', 'jason.martin@uc.cl'),
 ('Natalie Lane', '893-23-0369', '+1-942-497-5393x1664', 'natalie.lane@mail.cl')]

### TallerDeportivo

In [6]:
%%sql

SELECT *
FROM TallerDeportivo
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[(1, 'Taller deportivo 1', 'Felicia Rivera', '2023-03-24', '17:00', 8, 1, 'Handbol', 2, 7),
 (2, 'Taller deportivo 2', 'Tyler Ferguson', '2023-05-09', '11:00', 8, 1.5, 'Handbol', 2, 7),
 (3, 'Taller deportivo 3', 'Chris Bryant', '2023-01-16', '15:00', 6, 2, 'Voleibol', 2, 6),
 (4, 'Taller deportivo 4', 'Gregg Thompson', '2023-03-22', '13:00', 8, 2, 'Handbol', 2, 7),
 (5, 'Taller deportivo 5', 'Joanna Washington', '2022-06-30', '13:00', 2, 2, 'Voleibol', 2, 6)]

### TallerInstrumental

In [7]:
%%sql

SELECT *
FROM TallerInstrumental
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[(101, 'Taller Instrumental 1', 'Mr. Michael Mcguire', '2022-11-03', '11:00', 4, 1, 'Trompeta', 12),
 (102, 'Taller Instrumental 2', 'Cameron Evans', '2022-01-04', '15:00', 3, 1.5, 'Bajo', 2),
 (103, 'Taller Instrumental 3', 'Sheila Lewis', '2022-04-04', '13:00', 8, 1.5, 'Guitarra', 4),
 (104, 'Taller Instrumental 4', 'Ebony Smith', '2022-10-25', '14:00', 3, 1, 'Guitarra', 4),
 (105, 'Taller Instrumental 5', 'Jose Powell', '2022-05-09', '17:00', 5, 1.5, 'Bajo', 21)]

### Lugar

In [9]:
%%sql

SELECT *
FROM Lugar
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[(1, '8517 White Circle Suite 464West Christine, WY 25833', 54408, 92721, 'Glorialand', 'Syrian Arab Republic'),
 (2, '0394 Thompson Radial Apt. 440Martinburgh, WI 61668', 58837, 29150, 'Jacquelineborough', 'Saint Vincent and the Grenadines'),
 (3, '1241 Stevens Extension Suite 769Lopezshire, KS 78903', 23470, 49883, 'Troyberg', 'Bosnia and Herzegovina'),
 (4, '3031 Moore FallNorth Amandafort, HI 10818', 74384, 91003, 'East Eileenton', 'Palestinian Territory'),
 (5, '028 Julia StreamBarbaraburgh, FL 62048', 126, 75538, 'Port Katherineport', 'Marshall Islands')]

### Participa

In [10]:
%%sql

SELECT *
FROM Participa
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[('227-40-2546', 134),
 ('716-91-2023', 94),
 ('222-10-5678', 138),
 ('097-65-5254', 191),
 ('509-82-0904', 133)]

### EstáEn

In [63]:
%%sql

SELECT *
FROM EstaEn
LIMIT 5;

 * sqlite:///datos_T2.db
Done.

[(1, 37), (2, 38), (3, 42), (4, 20), (5, 25)]

##Pregunta 2

Ahora que tenemos nuestra base de datos preparada, la podemos analizar en más detalles. En esta primera pregunta te pedimos encontrar la(s) persona(s) qué participa(n) en máxima cantidad de talleres que se realizan en **Honduras**. Se requiere escribir una consulta SQL que recupera esta información sobre nuestro esquema. Esto quiere decir que la consulta debe devolver esta misma información sobre cualquier instancia de nuestro esquema, y no solo con la instancia que estamos revisando.


---
**Talleres en Honduras**

In [45]:
%%sql

SELECT EstaEn.idTaller, Lugar.Id as LugarId
FROM EstaEn 
LEFT JOIN TallerDeportivo ON EstaEn.IdTaller = TallerDeportivo.Id
LEFT JOIN TallerInstrumental ON EstaEn.IdTaller = TallerInstrumental.Id
LEFT JOIN Lugar ON EstaEn.idLugar = Lugar.Id
WHERE Lugar.nombrePais = 'Honduras'

 * sqlite:///datos_T2.db
Done.

[(1, 37), (21, 37), (33, 37), (160, 37), (172, 37)]

---
**Cantidad de talleres realizados en Honduras**

In [79]:
%%sql

SELECT COUNT(*) AS Total
FROM EstaEn 
LEFT JOIN TallerDeportivo ON EstaEn.IdTaller = TallerDeportivo.Id
LEFT JOIN TallerInstrumental ON EstaEn.IdTaller = TallerInstrumental.Id
LEFT JOIN Lugar ON EstaEn.idLugar = Lugar.Id
WHERE Lugar.nombrePais = 'Honduras'

 * sqlite:///datos_T2.db
Done.

[(5,)]

---
**Cantidad de participaciones en talleres por persona en Honduras**

In [80]:
%%sql

SELECT 
  Persona.rut,
  Persona.nombre,
  COUNT(*) AS ParticipacionPorPersonaEnTalleresDeHonduras
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
JOIN (
  SELECT EstaEn.idTaller AS TallerId, Lugar.Id AS LugarId
  FROM EstaEn 
  LEFT JOIN TallerDeportivo ON EstaEn.IdTaller = TallerDeportivo.Id
  LEFT JOIN TallerInstrumental ON EstaEn.IdTaller = TallerInstrumental.Id
  LEFT JOIN Lugar ON EstaEn.idLugar = Lugar.Id
  WHERE Lugar.nombrePais = 'Honduras'
) AS TalleresEnHonduras
ON Participa.idTaller = TalleresEnHonduras.TallerId
GROUP BY Persona.rut

 * sqlite:///datos_T2.db
Done.

[('114-10-5754', 'Brittany Mills', 1),
 ('757-47-6075', 'Crystal Mitchell', 1),
 ('853-31-9682', 'Laura Wallace', 1)]

---
**Persona(s) que participa(n) en máxima cantidad de talleres que se realizan en Honduras.**
Asumiendo que esto se refiere a:

"las personas que hayan participado mas veces en talleres ubicados en Honduras"

In [83]:
%%sql

SELECT 
  Persona.rut,
  Persona.nombre,
  COUNT(*) AS ParticipacionPorPersonaEnTalleresDeHonduras
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
JOIN (
  SELECT EstaEn.idTaller AS TallerId, Lugar.Id AS LugarId
  FROM EstaEn 
  LEFT JOIN TallerDeportivo ON EstaEn.IdTaller = TallerDeportivo.Id
  LEFT JOIN TallerInstrumental ON EstaEn.IdTaller = TallerInstrumental.Id
  LEFT JOIN Lugar ON EstaEn.idLugar = Lugar.Id
  WHERE Lugar.nombrePais = 'Honduras'
) AS TalleresEnHonduras
ON Participa.idTaller = TalleresEnHonduras.TallerId
GROUP BY Persona.rut
HAVING ParticipacionPorPersonaEnTalleresDeHonduras = (
  SELECT MAX(ParticipacionPorPersonaEnTalleresDeHonduras)
  FROM (
    SELECT 
    Persona.rut,
    Persona.nombre,
    COUNT(*) AS ParticipacionPorPersonaEnTalleresDeHonduras
    FROM Persona
    JOIN Participa ON Persona.rut = Participa.rut
    JOIN (
      SELECT EstaEn.idTaller AS TallerId, Lugar.Id AS LugarId
      FROM EstaEn 
      LEFT JOIN TallerDeportivo ON EstaEn.IdTaller = TallerDeportivo.Id
      LEFT JOIN TallerInstrumental ON EstaEn.IdTaller = TallerInstrumental.Id
      LEFT JOIN Lugar ON EstaEn.idLugar = Lugar.Id
      WHERE Lugar.nombrePais = 'Honduras'
    ) AS TalleresEnHonduras
    ON Participa.idTaller = TalleresEnHonduras.TallerId
    GROUP BY Persona.rut
  )

)

 * sqlite:///datos_T2.db
Done.

[('114-10-5754', 'Brittany Mills', 1),
 ('757-47-6075', 'Crystal Mitchell', 1),
 ('853-31-9682', 'Laura Wallace', 1)]

##Pregunta 3

Ahora nos interesaría encontrar el nombre del deporte más popular. Para esto, escriba la consulta SQL que encuentra el nombre de deporte de taller deportivo con la mayor cantidad de participantes. De nuevo, tu consulta debe funcionar sobre cualquier instancia de nuestro esquema.

---
**Participación por taller deportivo**

In [110]:
%%sql

SELECT TallerDeportivo.nombreTaller AS nombre, COUNT(*) AS total
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
JOIN TallerDeportivo ON Participa.idTaller = TallerDeportivo.id
GROUP BY TallerDeportivo.nombreTaller
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('Taller deportivo 11', 2),
 ('Taller deportivo 12', 1),
 ('Taller deportivo 13', 2),
 ('Taller deportivo 14', 1),
 ('Taller deportivo 15', 3)]

---
**Nombre de deporte de taller deportivo con la mayor cantidad de participantes**

In [108]:
%%sql

SELECT nombre
FROM (
  SELECT TallerDeportivo.nombreTaller AS nombre, COUNT(*) AS total
  FROM Persona
  JOIN Participa ON Persona.rut = Participa.rut
  JOIN TallerDeportivo ON Participa.idTaller = TallerDeportivo.id
  GROUP BY TallerDeportivo.nombreTaller
) AS ParticipacionPorTallerDeportivo
WHERE total = (
  SELECT MAX(total)
  FROM (
    SELECT TallerDeportivo.nombreTaller AS nombre, COUNT(*) AS total
    FROM Persona
    JOIN Participa ON Persona.rut = Participa.rut
    JOIN TallerDeportivo ON Participa.idTaller = TallerDeportivo.id
    GROUP BY TallerDeportivo.nombreTaller
  )
)

 * sqlite:///datos_T2.db
Done.

[('Taller deportivo 89',)]

##Pregunta 4

Ahora para cada taller instrumental cuenta el número de gente con el correo “@uc” participando. Debes escribir una consulta SQL que devuelve el id del taller, nombre del instrumento, y el número de personas con el correo “@uc” inscritas a este taller. Para filtrar la gente participando, ocupa el comando LIKE, que permite buscar sobre un string.

---
**Participacion de personas con correo uc en Taller Instrumental**

In [120]:
%%sql
SELECT *
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
JOIN TallerInstrumental ON Participa.idTaller = TallerInstrumental.id
WHERE Persona.correo LIKE '%@uc.cl'
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('Stephen Brooks', '227-40-2546', '001-646-589-3749x296', 'stephen.brooks@uc.cl', '227-40-2546', 134, 134, 'Taller Instrumental 34', 'Vincent Farmer', '2021-09-01', '12:00', 10, 1.5, 'Piano', 8),
 ('Donna Fleming', '222-10-5678', '705.135.8662', 'donna.fleming@uc.cl', '222-10-5678', 138, 138, 'Taller Instrumental 38', 'Jacqueline Suarez', '2023-06-12', '13:00', 8, 2, 'Batería', 8),
 ('Penny Kelly', '509-82-0904', '8683303033', 'penny.kelly@uc.cl', '509-82-0904', 133, 133, 'Taller Instrumental 33', 'Nancy Hogan', '2022-09-18', '11:00', 5, 1.5, 'Bajo', 10),
 ('Tyler Andrade', '069-79-3655', '001-813-374-6268x56379', 'tyler.andrade@uc.cl', '069-79-3655', 170, 170, 'Taller Instrumental 70', 'Dennis Maxwell', '2021-08-31', '13:00', 3, 1.5, 'Bajo', 20),
 ('Brad Jensen', '468-06-1826', '+1-590-912-5053', 'brad.jensen@uc.cl', '468-06-1826', 136, 136, 'Taller Instrumental 36', 'Aaron Walker', '2023-06-10', '14:00', 8, 2, 'Guitarra', 23)]

---
**Cantidad de personas de la uc inscritas por taller**

In [124]:
%%sql

SELECT TallerInstrumental.id AS TallerId, TallerInstrumental.instrumento, COUNT(*) as participantesUC
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
JOIN TallerInstrumental ON Participa.idTaller = TallerInstrumental.id
WHERE Persona.correo LIKE '%@uc.cl'
GROUP BY TallerInstrumental.nombreTaller

 * sqlite:///datos_T2.db
Done.

[(113, 'Batería', 1),
 (115, 'Batería', 1),
 (119, 'Violín', 1),
 (102, 'Bajo', 1),
 (130, 'Guitarra', 2),
 (133, 'Bajo', 1),
 (134, 'Piano', 1),
 (136, 'Guitarra', 1),
 (138, 'Batería', 1),
 (154, 'Batería', 1),
 (158, 'Piano', 1),
 (165, 'Guitarra', 1),
 (167, 'Violín', 1),
 (170, 'Bajo', 2),
 (179, 'Violín', 1),
 (188, 'Bajo', 1),
 (189, 'Piano', 1),
 (191, 'Guitarra', 1),
 (197, 'Trompeta', 1),
 (199, 'Piano', 1)]

##Pregunta 5

Para cada persona, computa la cantidad de talleres en cuales participa esta persona. Esto debe incluir tantos talleres deportivos, cómo talleres instrumentales. Una manera de resolver esta consulta es ocupando consultas anidadas en la cláusula `FROM`, computando dicho número para cada tipo de taller.

---
**Número de talleres deportivos por persona**

In [138]:
%%sql

SELECT Persona.rut as rut, COUNT(*) AS talleresDeportivos
FROM Persona 
JOIN Participa ON Persona.rut = Participa.rut
JOIN TallerDeportivo ON Participa.idTaller = TallerDeportivo.id
GROUP BY Persona.rut
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('001-41-3660', 1),
 ('014-15-4728', 1),
 ('021-88-4570', 2),
 ('040-28-7437', 1),
 ('045-60-3272', 1)]

---
**Número de talleres instrumental por persona**

In [141]:
%%sql

SELECT Persona.rut as rut, COUNT(*) AS talleresInstrumentales
FROM Persona 
JOIN Participa ON Persona.rut = Participa.rut
JOIN TallerInstrumental ON Participa.idTaller = TallerInstrumental.id
GROUP BY Persona.rut
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('028-31-7384', 1),
 ('045-60-3272', 1),
 ('046-78-2996', 2),
 ('056-10-7180', 1),
 ('069-79-3655', 1)]

---
**Número de talleres por persona**

In [145]:
%%sql

SELECT 
  Persona.rut,
  Persona.nombre,
  DeportivoPersona.talleresDeportivos AS TalleresDeportivos, 
  InstrumentalPersona.talleresInstrumentales AS TalleresInstrumentales,
  DeportivoPersona.talleresDeportivos + InstrumentalPersona.talleresInstrumentales AS TotalTalleres
FROM Persona
JOIN (
  SELECT Persona.rut as rut, COUNT(*) AS talleresDeportivos
  FROM Persona 
  JOIN Participa ON Persona.rut = Participa.rut
  JOIN TallerDeportivo ON Participa.idTaller = TallerDeportivo.id
  GROUP BY Persona.rut
) AS DeportivoPersona ON Persona.rut = DeportivoPersona.rut
JOIN (
  SELECT Persona.rut as rut, COUNT(*) AS talleresInstrumentales
  FROM Persona 
  JOIN Participa ON Persona.rut = Participa.rut
  JOIN TallerInstrumental ON Participa.idTaller = TallerInstrumental.id
  GROUP BY Persona.rut
) AS InstrumentalPersona ON Persona.rut = InstrumentalPersona.rut
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('045-60-3272', 'Christopher Cruz', 1, 1, 2),
 ('046-78-2996', 'Ashley Peterson', 1, 2, 3),
 ('056-10-7180', 'Timothy Delgado', 1, 1, 2),
 ('106-26-6898', 'Michele Wolfe', 1, 1, 2),
 ('187-23-5065', 'Aaron Ford', 1, 1, 2)]

---
**Número de talleres por persona versión 2**

In [146]:
 %%sql

SELECT 
  Persona.rut,
  Persona.nombre,
  COUNT(*) AS TotalTalleres
FROM Persona
JOIN Participa ON Persona.rut = Participa.rut
GROUP BY Persona.rut
LIMIT 5

 * sqlite:///datos_T2.db
Done.

[('001-41-3660', 'Nicholas Bean', 1),
 ('014-15-4728', 'Morgan Anderson', 1),
 ('021-88-4570', 'Michelle Donaldson', 2),
 ('028-31-7384', 'Mr. Richard Alexander', 1),
 ('040-28-7437', 'Andrew Hodges', 1)]